Revit 2024 API
AdaptiveComponentFamilyUtils.IsAdaptiveComponentFamily Method
 Verifies if the Family is an Adaptive Component Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool IsAdaptiveComponentFamily(
	Family family
)
Visual Basic
Public Shared Function IsAdaptiveComponentFamily ( _
	family As Family _
) As Boolean
Visual C++
public:
static bool IsAdaptiveComponentFamily(
	Family^ family
)
Parameters
family
Type: Autodesk.Revit.DB.Family
 The Family
Return Value
 True if the Family is an Adaptive Component Family.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace